#### Terraform Plan 📋 `prod/kubernetes`

**Summary:** 16:20:45.930 STDOUT terraform: Plan: 2 to add, 0 to change, 0 to destroy.

<details><summary>Show Plan Details</summary>

```terraform
16:20:45.928 STDOUT terraform:   # digitalocean_kubernetes_cluster.k8s will be created
16:20:45.928 STDOUT terraform:   + resource "digitalocean_kubernetes_cluster" "k8s" {
16:20:45.928 STDOUT terraform:       + auto_upgrade                     = true
16:20:45.928 STDOUT terraform:       + cluster_subnet                   = (known after apply)
16:20:45.928 STDOUT terraform:       + created_at                       = (known after apply)
16:20:45.928 STDOUT terraform:       + destroy_all_associated_resources = false
16:20:45.928 STDOUT terraform:       + endpoint                         = (known after apply)
16:20:45.928 STDOUT terraform:       + ha                               = false
16:20:45.928 STDOUT terraform:       + id                               = (known after apply)
16:20:45.928 STDOUT terraform:       + ipv4_address                     = (known after apply)
16:20:45.928 STDOUT terraform:       + kube_config                      = (sensitive value)
16:20:45.928 STDOUT terraform:       + name                             = "prod-cluster"
16:20:45.928 STDOUT terraform:       + region                           = "fra1"
16:20:45.928 STDOUT terraform:       + registry_integration             = false
16:20:45.928 STDOUT terraform:       + service_subnet                   = (known after apply)
16:20:45.928 STDOUT terraform:       + status                           = (known after apply)
16:20:45.928 STDOUT terraform:       + surge_upgrade                    = true
16:20:45.928 STDOUT terraform:       + updated_at                       = (known after apply)
16:20:45.929 STDOUT terraform:       + urn                              = (known after apply)
16:20:45.929 STDOUT terraform:       + version                          = "1.32.10-do.2"
16:20:45.929 STDOUT terraform:       + vpc_uuid                         = "dea2552a-4a3c-4a0c-9755-4ccb5e07aafe"
16:20:45.929 STDOUT terraform:       + amd_gpu_device_metrics_exporter_plugin (known after apply)
16:20:45.929 STDOUT terraform:       + amd_gpu_device_plugin (known after apply)
16:20:45.929 STDOUT terraform:       + control_plane_firewall (known after apply)
16:20:45.929 STDOUT terraform:       + maintenance_policy {
16:20:45.929 STDOUT terraform:           + day        = "saturday"
16:20:45.929 STDOUT terraform:           + duration   = (known after apply)
16:20:45.929 STDOUT terraform:           + start_time = "03:00"
16:20:45.929 STDOUT terraform:         }
16:20:45.929 STDOUT terraform:       + node_pool {
16:20:45.929 STDOUT terraform:           + actual_node_count = (known after apply)
16:20:45.929 STDOUT terraform:           + auto_scale        = true
16:20:45.929 STDOUT terraform:           + id                = (known after apply)
16:20:45.929 STDOUT terraform:           + labels            = {
16:20:45.929 STDOUT terraform:               + "owner"    = "DevOps-Team"
16:20:45.929 STDOUT terraform:               + "priority" = "high"
16:20:45.929 STDOUT terraform:               + "service"  = "app"
16:20:45.929 STDOUT terraform:             }
16:20:45.929 STDOUT terraform:           + max_nodes         = 10
16:20:45.929 STDOUT terraform:           + min_nodes         = 3
16:20:45.929 STDOUT terraform:           + name              = "prod-app-pool"
16:20:45.929 STDOUT terraform:           + node_count        = 3
16:20:45.929 STDOUT terraform:           + nodes             = (known after apply)
16:20:45.929 STDOUT terraform:           + size              = "s-2vcpu-8gb"
16:20:45.929 STDOUT terraform:           + tags              = [
16:20:45.929 STDOUT terraform:               + "component:kubernetes",
16:20:45.929 STDOUT terraform:               + "environment:prod",
16:20:45.929 STDOUT terraform:               + "project:my-devops-project",
16:20:45.929 STDOUT terraform:             ]
16:20:45.929 STDOUT terraform:           + taint {
16:20:45.929 STDOUT terraform:               + effect = "NoSchedule"
16:20:45.929 STDOUT terraform:               + key    = "service"
16:20:45.929 STDOUT terraform:               + value  = "app"
16:20:45.929 STDOUT terraform:             }
16:20:45.929 STDOUT terraform:         }
16:20:45.929 STDOUT terraform:       + nvidia_gpu_device_plugin (known after apply)
16:20:45.929 STDOUT terraform:       + rdma_shared_device_plugin (known after apply)
16:20:45.929 STDOUT terraform:       + routing_agent (known after apply)
16:20:45.929 STDOUT terraform:     }
16:20:45.929 STDOUT terraform:   # digitalocean_kubernetes_node_pool.monitoring will be created
16:20:45.929 STDOUT terraform:   + resource "digitalocean_kubernetes_node_pool" "monitoring" {
16:20:45.929 STDOUT terraform:       + actual_node_count = (known after apply)
16:20:45.929 STDOUT terraform:       + auto_scale        = false
16:20:45.929 STDOUT terraform:       + cluster_id        = (known after apply)
16:20:45.929 STDOUT terraform:       + id                = (known after apply)
16:20:45.929 STDOUT terraform:       + labels            = {
16:20:45.929 STDOUT terraform:           + "owner"    = "DevOps-Team"
16:20:45.930 STDOUT terraform:           + "priority" = "low"
16:20:45.930 STDOUT terraform:           + "service"  = "monitoring"
16:20:45.930 STDOUT terraform:         }
16:20:45.930 STDOUT terraform:       + max_nodes         = 2
16:20:45.930 STDOUT terraform:       + min_nodes         = 1
16:20:45.930 STDOUT terraform:       + name              = "prod-monitoring-pool"
16:20:45.930 STDOUT terraform:       + node_count        = 1
16:20:45.930 STDOUT terraform:       + nodes             = (known after apply)
16:20:45.930 STDOUT terraform:       + size              = "s-2vcpu-2gb"
16:20:45.930 STDOUT terraform:       + tags              = [
16:20:45.930 STDOUT terraform:           + "component:kubernetes",
16:20:45.930 STDOUT terraform:           + "environment:prod",
16:20:45.930 STDOUT terraform:           + "project:my-devops-project",
16:20:45.930 STDOUT terraform:         ]
16:20:45.930 STDOUT terraform:       + taint {
16:20:45.930 STDOUT terraform:           + effect = "NoSchedule"
16:20:45.930 STDOUT terraform:           + key    = "service"
16:20:45.930 STDOUT terraform:           + value  = "monitoring"
16:20:45.930 STDOUT terraform:         }
16:20:45.930 STDOUT terraform:     }
16:20:45.930 STDOUT terraform: Plan: 2 to add, 0 to change, 0 to destroy.
16:20:45.930 STDOUT terraform: Changes to Outputs:
16:20:45.930 STDOUT terraform:   + app_node_pool_id        = (known after apply)
16:20:45.930 STDOUT terraform:   + cluster_ca_certificate  = (sensitive value)
16:20:45.930 STDOUT terraform:   + cluster_id              = (known after apply)
16:20:45.930 STDOUT terraform:   + cluster_token           = (sensitive value)
16:20:45.930 STDOUT terraform:   + endpoint                = (known after apply)
16:20:45.930 STDOUT terraform:   + kubeconfig              = (sensitive value)
16:20:45.930 STDOUT terraform:   + monitoring_node_pool_id = (known after apply)
16:20:46.013 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
16:20:46.013 STDOUT terraform: Saved the plan to: tfplan
16:20:46.013 STDOUT terraform: To perform exactly these actions, run the following command to apply:
16:20:46.013 STDOUT terraform:     terraform apply "tfplan"
```

</details>

*Pusher: @krukmaksym, Action: `pull_request`, Workflow: `Terraform PR Validation`*